Examples/manipulateFvSolutionFvSchemes/pitzDailyStateMachineSwitched/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs (
    "libswakStateMachine.so"
);

functions
{
    solutionMachine {
        type stateMachineCreateAndUpdate;
        valueType patch;
        patchName inlet;
        machineName relaxationMachine;
        states (
            normal
            high
        );
        initialState normal;
        transitions (
            {
                from normal;
                to high;
                condition "time()>200";
                logicalAccumulation and;
                description "Try higher relaxation";
            }
        );
    }
    schemesMachine {
        $solutionMachine;
        machineName divMachine;
        states (
            upwind
            linear
        );
        initialState linear;
        transitions (
            {
                from upwind;
                to linear;
                condition "stateMachine_timeSinceChange(divMachine)>=45";
                logicalAccumulation or;
                description "Try working differently";
            }
            {
                from linear;
                to upwind;
                condition "stateMachine_timeSinceChange(divMachine)>=5";
                logicalAccumulation or;
                description "Slow down";
            }
        );
    }
    switchSolverSettings
    {
        type stateMachineFvSolutionFvSchemes;
        outputControlMode timeStep;
        outputInterval 1;
        solutionStateMachine relaxationMachine;
        stateToSolution (
            high higherRelax
        );
        schemesStateMachine divMachine;
        stateToSchemes (
            linear linearDiv
        );
        resetBeforeTrigger true;
    }
    streamLines
    {
        type            streamLine;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libfieldFunctionObjects.so");

        // Output every
        outputControl   outputTime;
        // outputInterval 10;

        setFormat       vtk; //gnuplot;//xmgr;//raw;//jplot;//csv;//ensight;

        // Velocity field to use for tracking.
        UName U;

        // Tracked forwards (+U) or backwards (-U)
        trackForward    true;

        // Names of fields to sample. Should contain above velocity field!
        fields (p k U);

        // Steps particles can travel before being removed
        lifeTime        10000;

        // Number of steps per cell (estimate). Set to 1 to disable subcycling.
        nSubCycle 5;

        // Cloud name to use
        cloudName       particleTracks;

        // Seeding method. See the sampleSets in sampleDict.
        seedSampleSet   uniform;  //cloud;//triSurfaceMeshPointSet;

        uniformCoeffs
        {
            type        uniform;
            axis        x;  //distance;

            start       (-0.0205 0.001  0.00001);
            end         (-0.0205 0.0251 0.00001);
            nPoints     10;
        }
    }
}

// ************************************************************************* //
